[Reference](https://towardsdatascience.com/alluring-python-pandas-834fe1656a34)

In [2]:
import pandas as pd

In [8]:
df = pd.DataFrame({'City': ['Singapore','London','Hong Kong','Paris','Moscow'],
                   'City Population': [563, 898, 745, 215, 1192],
                   'City Area': [721.5, 1572, 1106, 105.4, 2511],
                   'Currency':['SGD','GBP','HKD','EUR','RUB'],
                   'Continent':['Asia','Europe','Asia','Europe','Europe'],
                   'Main Language': ['English','English','Chinese','French','Russian']})

# 1) Sort Data in different orders

In [4]:
df.sort_values(by = ['Continent','City Population'], ascending=[True,False])

        City  City Population  City Area Currency Continent Main Language
2  Hong Kong              745     1106.0      HKD      Asia       Chinese
0  Singapore              563      721.5      SGD      Asia       English
4     Moscow             1192     2511.0      RUB    Europe       Russian
1     London              898     1572.0      GBP    Europe       English
3      Paris              215      105.4      EUR    Europe        French

In [5]:
df.sort_values(by = ['Continent','Main Language','City Population'], ascending=[True,False,True])

        City  City Population  City Area Currency Continent Main Language
0  Singapore              563      721.5      SGD      Asia       English
2  Hong Kong              745     1106.0      HKD      Asia       Chinese
4     Moscow             1192     2511.0      RUB    Europe       Russian
3      Paris              215      105.4      EUR    Europe        French
1     London              898     1572.0      GBP    Europe       English

# 2) Add New Column in Specific Location

In [6]:
# df['Population density'] = df['City Population']/df['City Area']

In [9]:
df.insert(loc=3, column='Population density', value=(df['City Population']/df['City Area']))

In [10]:
df.head()

        City  City Population  City Area  ...  Currency Continent Main Language
0  Singapore              563      721.5  ...       SGD      Asia       English
1     London              898     1572.0  ...       GBP    Europe       English
2  Hong Kong              745     1106.0  ...       HKD      Asia       Chinese
3      Paris              215      105.4  ...       EUR    Europe        French
4     Moscow             1192     2511.0  ...       RUB    Europe       Russian

[5 rows x 7 columns]

# 3) Select Column base on Data Type

In [11]:
df.select_dtypes(include='float')

   City Area  Population density
0      721.5            0.780319
1     1572.0            0.571247
2     1106.0            0.673599
3      105.4            2.039848
4     2511.0            0.474711

In [12]:
df.select_dtypes(exclude='object')

   City Population  City Area  Population density
0              563      721.5            0.780319
1              898     1572.0            0.571247
2              745     1106.0            0.673599
3              215      105.4            2.039848
4             1192     2511.0            0.474711

In [13]:
df.select_dtypes(exclude=['int64','float64'])

        City Currency Continent Main Language
0  Singapore      SGD      Asia       English
1     London      GBP    Europe       English
2  Hong Kong      HKD      Asia       Chinese
3      Paris      EUR    Europe        French
4     Moscow      RUB    Europe       Russian

In [14]:
df.select_dtypes(include='number',exclude='float64')

   City Population
0              563
1              898
2              745
3              215
4             1192

# 4) Filter Column Based on Partial Match

In [15]:
df.filter(like='la', axis=1)

df.filter(like='Po', axis=1)

df.filter(like='tion', axis=1)

   City Population  Population density
0              563            0.780319
1              898            0.571247
2              745            0.673599
3              215            2.039848
4             1192            0.474711